ГТС/УТГТС/InformationRegisters/СервисСверкиРасчетовУстраненныеРасхождения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовУстраненныеРасхождения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРасхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/СервисСверкиРасчетовУстраненныеРасхождения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(Организация, Контрагент, ИдентификаторРасхождения, СуммаДокумента, НДСДокумента) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.СервисСверкиРасчетовУстраненныеРасхождения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация              = Организация; 
	МенеджерЗаписи.Контрагент               = Контрагент;
	МенеджерЗаписи.ИдентификаторРасхождения = ИдентификаторРасхождения;
	МенеджерЗаписи.СуммаДокумента           = СуммаДокумента;
	МенеджерЗаписи.НДСДокумента             = НДСДокумента;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОчиститьУстраненныеРасхождения() Экспорт
	
	НаборЗаписейРасхождения = РегистрыСведений.СервисСверкиРасчетовУстраненныеРасхождения.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
